In [8]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:
%sql mssql+pyodbc://@localhost/PythonPracticeDB?driver=ODBC+Driver+17+for+SQL+Server

In [ ]:
# SQL Practice Script: Basics
# ✅ Use this in VS Code with MS SQL extension

# 1. View all Employees
%sql %sql SELECT * FROM Employees

 * mssql+pyodbc://@localhost/PythonPracticeDB?driver=ODBC+Driver+17+for+SQL+Server
Done.

[(201, 'Ahmed', 'Khan', 1, 1, datetime.date(2020, 1, 10)),
 (202, 'Zara', 'Sheikh', 2, 2, datetime.date(2021, 5, 15)),
 (203, 'Imran', 'Ali', 3, 3, datetime.date(2019, 11, 1)),
 (204, 'Sana', 'Malik', 4, 4, datetime.date(2018, 6, 20)),
 (205, 'Ayesha', 'Qureshi', 1, 1, datetime.date(2022, 2, 1)),
 (207, 'Tariq', 'Zaman', 3, 3, datetime.date(2020, 7, 25)),
 (208, 'Tania', 'Agarwal', 2, 2, datetime.date(2022, 3, 1))]

In [ ]:

# 2. View all Departments
%sql SELECT * FROM Departments
 
 # 3. View all Designations
 %sql SELECT * FROM Designations

 # 4. View all Salaries
 %sql SELECT * FROM Salaries

 # 5. Insert a new Employee
 INSERT INTO Employees (EmpID,FirstName,LastName ,DeptID , DesigID , JoinDate)
 VALUES (208 , 'Tania' , 'Agarwal' , 2,2, '2022-03-1');

 #6: Insert Salary for new Employee (208)
INSERT INTO Salaries (EmpID ,BasicSalary, Allowance,Deductions )
 VALUES(208, 48000,3000,1500);

 # 7. Update an Employee's Designation
UPDATE Employees
 SET DesigID = 4
WHERE EmpID = 206;

 # 7. Delete an Employee

DELETE FROM Salaries
WHERE EmpID = 206

DELETE from Employees
WHERE EmpID = 206;

# 8. Add a new column to Salaries table
ALTER TABLE Salaries
ADD Bonus DECIMAL(10,2)

# 9. Update Bonus for an employee
UPDATE Salaries
SET Bonus = 2500
WHERE EmpID =205;

# 10. Drop the Bonus column 
ALTER TABLE salaries
DROP COLUMN Bonus;

# ✅ INTERMEDIATE LEVEL QUERIES (JOIN, GROUP BY, CASE)
%sql SELECT E.EmpID, FirstName, LastName, BasicSalary, Allowance
FROM Employees E
JOIN Salaries S ON E.EmpID = S.EmpID;

# 12. Join Employees with Departments
%sql SELECT E.FirstName , E.LastName , D.DeptName
FROM Employees E
JOIN Departments D ON E.DeptID = D.DeptID

# 13. Total Salary (Basic + Allowance) for each employee
%sql SELECT EmpID , (BasicSalary + Allowance) AS  TotalSalary
From salaries

In [ ]:

# 14. Use CASE to show tax status
%sql SELECT EmpID, BasicSalary,
  CASE 
    WHEN BasicSalary > 5000 THEN 'Taxable'
    ELSE 'Non-Taxable'
  END AS TaxStatus
FROM Salaries;

IndentationError: unexpected indent (4020310855.py, line 3)

In [19]:

# 15. Count employees in each department
%sql SELECT DeptID, COUNT(*) AS TotalEmployees FROM Employees GROUP BY DeptID;

 * mssql+pyodbc://@localhost/PythonPracticeDB?driver=ODBC+Driver+17+for+SQL+Server
Done.

[(1, 2), (2, 2), (3, 2), (4, 1)]

In [ ]:

# 16. Average salary per department
%sql SELECT E.DeptID, AVG(S.BasicSalary) AS AvgSalary
FROM Employees E
JOIN Salaries S ON E.EmpID = S.EmpID
GROUP BY E.DeptID;

# 17. Employees who joined after 2022
%sql SELECT * FROM Employees
WHERE JoinDate > '2022-01-01';

# 18. Get top 3 highest salaries
%sql SELECT TOP 3 EmpID, BasicSalary
FROM Salaries
ORDER BY BasicSalary DESC;

# 19. Employees without salary records
%sql SELECT *
FROM Employees
WHERE EmpID NOT IN (%sql SELECT EmpID FROM Salaries);

# 20. Show full name and total salary
%sql SELECT FirstName + ' ' + LastName AS FullName,
       (BasicSalary + Allowance - ISNULL(Deductions, 0)) AS NetSalary
FROM Employees E
JOIN Salaries S ON E.EmpID = S.EmpID;

# ✅ You're now practicing %sql SELECT, INSERT, UPDATE, DELETE, ALTER, JOIN, GROUP BY, CASE
%sql SELECT EmpID, Bonus FROM Salaries;

%sql SELECT COLUMN_NAME 
FROM INFORMATION_SCHEMA.COLUMNS 
WHERE TABLE_NAME = 'Salaries';

UPDATE Salaries
SET Bonus = 2500
WHERE EmpID = 201;

UPDATE Salaries
SET Bonus = 1000
WHERE Bonus IS NULL;